def area(a, b):
    '''Вычисляет площадь прямоугольника.

    Args:
        a (float): Длина первой стороны прямоугольника.
        b (float): Длина второй стороны прямоугольника.

    Returns:
        float: Площадь прямоугольника.
    '''
    return a * b


def perimeter(a, b):
    '''Вычисляет периметр прямоугольника.

    Args:
        a (float): Длина первой стороны прямоугольника.
        b (float): Длина второй стороны прямоугольника.

    Returns:
        float: Периметр прямоугольника.
    '''
    return (a + b) * 2
